export const EXPERIENCE_TW = {
  sentences: `情緒管控是關鍵而態度決定一切`,
  fujenUniversity: {
    title: `輔仁大學-資訊工程系`,
    topic: `學業, 社團, 打工充實我的學生生活`,
    desc: `資訊工程系的相關課程讓我對於web能輕易理解, 課程中不乏計算機概論, 演算法, 資料結構, 資料庫, 作業系統..等等. 對於我日後工作上幫助很多! 學生時期的我, 也熱烈地在參與社團, 擔任幹部, 為社團而努力. 之間也一直都有在打工, 最長的一段是在星巴克待了2年直到畢業. 社團, 打工的經驗讓我能快速的適應社會, 並有效的與他人溝通. 這些經驗都是非常難能可貴的, 充實我的學生生活.`
  },
  aite: {
    title: `艾特網路`,
    topic: `小而精實不到10人的的網創圈新創公司`,
    desc: `大學畢業找尋選擇第一份工作時, 心中就已鎖定要找新創公司了. 當時認為那是一個能讓我快速成長的環境. 事實證明, 我的選擇沒有錯! 我也很感激在這裡的一切! 艾特網路很特別, 上班的第一天就是公司正式開始的第一天, 公司的一點一滴, 從logo, 活動到產品的發想, 幾乎都是大家一起努力出來的結果. 公司也積極參與活動, 像是hackthon, 新北idea show等等.. 對我來說那段時間真的成長很多, 擴展不同的眼界. 在公司只有我是junior且是唯一一個負責前端大小事務, 什麼都不太行, 吃了不少苦頭, 但漸漸的我步上軌道, 成為能獨當一面的一份子! 每天, 對於一間新創公司都是一個挑戰, 沒有人知道下一秒會發生什麼事, 遇到什麼困難. 曾經, 公司就剩下老闆與我, 帶著實習生一起做產品的另類時光, 那又是另一個故事了. 不論如何, 我從不後悔進入艾特網路, 在這裡所學到的東西, 都讓我在未來打下基礎.`
  },
  eztravel: {
    title: `易遊網`,
    topic: `資訊部門100多人的中大型網路起家旅遊業`,
    desc: `易遊網是一間網路起家的公司, 在當時算是領先市場的起家, 但是卻在2008年網站就沒在更新過了! 因此決定從回電商本業, 把所有專案逐一改版! 因此, 我決定進來幫助公司, 看看不同的人, 不同的做法, 看看中大型公司多人合作的情況, 避免成為井底之蛙. 在這邊是以線別分團隊專案制, 全部的前端大概有10多個. 先後曾做過票券專案, ucar專案, 並在首頁改版專案中擔任主要統整, 分配前端大小事務. 中間也曾進入UED team與行銷, PM單位溝通如何讓產品與工作流程更好. 我想大公司與新創公司最大的不同是, 人越多溝通的成本越高且有大公司的負擔, 但也相對穩定, 一切沒有好壞之分, 端看個人適合與否. 在這得到很多前輩與同事的幫忙, 而我自身也熱於幫助他人解決問題, 分享不同的東西. 期望自己能夠不要停滯, 持續朝自己的路前進!`
  },
  istaging: {
    title: `宅妝股份有限公司`,
    topic: `變化快速走在尖端的新創公司`,
    desc: `宅妝是一間專注於AR/VR領域的一間跨國公司, 客戶來自世界各地, 產品多國語系為基本. 在這邊一切都很新奇, 這也是我最後選擇來宅妝的主要原因之一. 使用webVR如aframe等等較為創新的技術, 處理過各種特殊事情, 像是阿拉伯文版面與排版必須要整個相反等等.. 變化相當快速. 前端配置為2-3人, 組織較為扁平, 自己為自己負責. 期間也代表一同前往巴賽隆納參加MWC(世界行動通訊大會)擴展視野. 是一個非常難得的經歷! 工作一陣子後, 我想最重要的還是保持自己那顆不斷學習的心與瞭解趨勢, 才不會停滯.`
  }
}
