import {
  MERMER_SKILLS_TW
} from '@/locales/zh-tw/skills'
import {
  MERMER_PROJECTS_TW
} from '@/locales/zh-tw/projects'

export const HELPER_TW = {
  menu: {
    aboutWebsite: `關於新網站`,
    oldWebsite: `前往舊網站`,
    messageBoard: `留言板`,
    moreme: `更多的我`,
    backEntry: `回首頁VR`
  },
  aboutWebsite: {
    desc: `一直以來, 我都覺得每一個前端工程師都應該要擁有一個自己的網站, 這樣的一個網站不僅僅是為了呈現自己, 還可以實現各種有趣的想法(做side project也是一樣的道理). 這次結合了一些有趣的東西或工作上沒做到的部分像是A-frame, threejs, test, storybook, travisCI等等..雖然我每次都天馬行空的做一些有的沒的然後沒有顧好許多design使用者體驗, 但在我思考, 規劃, 實作整個專案的元件與架構的過程中, 這些經驗都是非常難能可貴的! 如果你有google cardboard之類的裝置的話, 你可以戴起來體驗webVR. 至於舊網站我還是會保留著, 讓我可以去比較現在與當時想法的差異. 我覺得每隔一段時間都來重新打造一次自己的個人網站非常有趣! 這讓我可以持續的保持熱情在這塊領域上. 每個人的做法都不同, 就看你如何持續精進自己. 勇於接受未來的任何挑戰.`,
    conclusion: `一起試試吧! 做一個自己的個人網站並分享給大家, 共勉之!`
  },
  moreme: {
    intro: `您好, 我是胡哲維, 目前居住在台灣.`,
    working: `工作上, 我每天都保持著學習的熱誠來面對每天的挑戰. 身為一個前端工程師, 必須要不斷的學習與接觸新的東西, 才不會被時代的潮流淘汰, 我覺得有著一個正確的心態很重要, 這對我來說反而是一種吸引, 反而讓我更是喜歡自己的工作. 我也很熱於教導他人, 有著以前社團的經驗, 我非常善於循循善誘引導並給予建議! 畢竟教學相長, 教別人的同時也能讓我自己更加清楚, 何樂而不為呢. 我覺得工作上的同事與私底下的朋友並沒有什麼不同, 工作的同時也是在交朋友, 畢竟工作, 佔了我們一生中大部分的時間, 唯有用正確的態度來面對才是長久之道!`,
    basketball: `我最喜歡的運動就是籃球, 我從國中開始接觸籃球, 就離不開它了! 現在每個禮拜至少都會打一次, 假日不時的會有比賽, 可以享受比賽的樂趣. 打籃球的過程中也能學習到不少, 籃球是我的生命, 我想我會一直就這樣的打下去吧!`,
    dance: `高中大學時期有在玩社團, 接觸了跳舞, 跳舞是一件很快樂的事! 社團的大家一起為社團努力對我來說是一段很珍貴的回憶, 現在我也是每個禮拜會去舞蹈教室動動身體. 有時候工作累了動一動, 還蠻放鬆的.`,
    photo: `我玩攝影, 拍照是一種態度! 每張照片都是獨一無二的, 不論是捕捉生活中一些不經意的畫面或者是世界上不可多得的美景都是一件很幸福的事! 我的夢想之一就是辦個攝影展找個空間讓大家欣賞我拍的照片. (希望真的有那一天) 有時候放下腳步, 靜下心, 看一看, 你會發現這世界是多麽的美妙!`,
    instrument: `音樂陶冶我的生活, 我想沒有一個人會說自己不喜歡音樂吧! 我曾經碰過爵士鼓, 學過鋼琴, 玩音樂真的是很有趣! 讓我的人生增色不少. 雖然已經很久很久沒有再碰樂器了, 也許有一天我會回去繼續學重新開始吧.`,
    family: `我很幸運, 有一個健康的家庭. 家裡還有一狗一貓. 從我出身到現在, 我的身旁都有著狗的陪伴, 他們就像我的家人一樣, 跟著我們一起吃, 一起玩, 一起睡. 我們每天都會出門溜貓跟狗, 帶他們散步! 不帶他們出去還會哭呢! 我的父母非常開明, 他們一向都很尊重我的想法並且支持著我, 這真的是很難能可貴的一件事! 我愛我的家人, 能擁有這樣一個完整的家庭, 真的很幸運!`
  },
  mermer: {
    skills: MERMER_SKILLS_TW,
    projects: MERMER_PROJECTS_TW
  }
}
